##ΠΑΝΕΛΛΑΔΙΚΕΣ ΕΞΕΤΑΣΕΙΣ
##HMEΡΗΣΙΩΝ – ΕΣΠΕΡΙΝΩΝ ΕΠΑΓΓΕΛΜΑΤΙΚΩΝ ΛΥΚΕΙΩΝ
##ΤΡΙΤΗ 11 ΙΟΥΝΙΟΥ 2024
##ΕΞΕΤΑΖΟΜΕΝΟ ΜΑΘΗΜΑ:
##ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ ΥΠΟΛΟΓΙΣΤΩΝ
##
##ΘΕΜΑ B
##B2. Δίνεται η παρακάτω λίστα:
##0	1	2	3	4	5	6	7	8	9
##235	181	145	98	73	42	31	29	12	7
##Να εκτελέσετε τον αλγόριθμο της δυαδικής αναζήτησης για:
##α) τον αριθμό 85 (μον.4)
##β) τον αριθμό 12 (μον.3)
##Να γράψετε στο τετράδιό σας τους αριθμούς που θα συγκριθούν κατά την
##εκτέλεση του αλγορίθμου σε κάθε μία από τις παραπάνω περιπτώσεις.
##Μονάδες 7
def binary_search(alist, num):   
    N = len(alist)
    left = 0
    right = N-1
    number_passes = 1
    pos = -1
    while left <= right and pos == -1:
        mid = (left+right)//2
        print("Πέρασμα: {}, Αριθμός: {}".format(number_passes, alist[mid]))
        if alist[mid] == num:
            pos = mid
            print("Βρέθηκε το {} στην θέση {}".format(num, pos))
            return pos
        elif alist[mid] > num:
            left = mid+1
            number_passes += 1
            print("Αριθμός μεγαλύτερος")
        elif alist[mid] < num:
            right = mid-1
            number_passes += 1
            print("Αριθμός μικρότερος")
    else:
        print("Δεν βρέθηκε το {}".format(num))
    return pos

alist=[235,181,145,98,73,42,31,29,12,7]
binary_search(alist, 85)
binary_search(alist, 12)
##Πέρασμα: 1, Αριθμός: 73
##Πέρασμα: 2, Αριθμός: 181
##Πέρασμα: 3, Αριθμός: 145
##Πέρασμα: 4, Αριθμός: 98
##Δεν βρέθηκε το 85
##Πέρασμα: 1, Αριθμός: 73
##Πέρασμα: 2, Αριθμός: 29
##Πέρασμα: 3, Αριθμός: 12
##Βρέθηκε το 12 στην θέση 8
##
##B3. Δίνεται το παρακάτω τμήμα προγράμματος σε γλώσσα προγραμματισμού Python:
##for i in range (10):
##    for j in range (10, -1, -1):
##        print i*j
##Να ξαναγράψετε στο τετράδιό σας το παραπάνω τμήμα προγράμματος,
##αντικαθιστώντας τις εντολές for με while, έτσι ώστε να εμφανίζεται το
##ίδιο αποτέλεσμα.
##Μονάδες 9
for i in range(10):
    for j in range(10, -1, -1):
        print(i*j, end=' ')
    print()
##0 0 0 0 0 0 0 0 0 0 0 
##10 9 8 7 6 5 4 3 2 1 0 
##20 18 16 14 12 10 8 6 4 2 0 
##30 27 24 21 18 15 12 9 6 3 0 
##40 36 32 28 24 20 16 12 8 4 0 
##50 45 40 35 30 25 20 15 10 5 0 
##60 54 48 42 36 30 24 18 12 6 0 
##70 63 56 49 42 35 28 21 14 7 0 
##80 72 64 56 48 40 32 24 16 8 0 
##90 81 72 63 54 45 36 27 18 9 0 
i = 0
while i < 10:
    j = 10
    while j > -1:
        print(i*j, end=' ')
        j += -1
    print()
    i += 1
##0 0 0 0 0 0 0 0 0 0 0 
##10 9 8 7 6 5 4 3 2 1 0 
##20 18 16 14 12 10 8 6 4 2 0 
##30 27 24 21 18 15 12 9 6 3 0 
##40 36 32 28 24 20 16 12 8 4 0 
##50 45 40 35 30 25 20 15 10 5 0 
##60 54 48 42 36 30 24 18 12 6 0 
##70 63 56 49 42 35 28 21 14 7 0 
##80 72 64 56 48 40 32 24 16 8 0 
##90 81 72 63 54 45 36 27 18 9 0 
